astb_relise/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПодписчикаДоставляемыхУведомлений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомлятьОбОбработкеОбращений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомлятьОПолученииСредствЗащиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Texel_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/Enums/СпособыАвтоматическогоФормированияЛогиновВнешнихПользователей/СпособыАвтоматическогоФормированияЛогиновВнешнихПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыАвтоматическогоФормированияЛогиновВнешнихПользователей</name>
  <enumValues>
    <name>ФамилияИО</name>
  </enumValues>
  <enumValues>
    <name>ТабельныйНомер</name>
  </enumValues>
  <enumValues>
    <name>Префикс_ТабельныйНомер</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияСИЗ</name>
    <type>
      <types>CatalogRef.МестаХраненияСИЗСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаДляЛичнойКарточки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/Catalogs/ВнешниеПользователи/ВнешниеПользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеПользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектАвторизации</name>
    <type>
      <types>DefinedType.ВнешнийПользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановитьРолиНепосредственно</name>
    <comment>Используется, если не встроена подсистема &quot;Управление доступом&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/Catalogs/ФизическиеЛица/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВнешниеПользователи.НастроитьОтображениеСпискаВнешнихПользователей(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВнешнихПользователейНаСервере(МассивФизическихЛиц)

	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого ФизическоеЛицо Из МассивФизическихЛиц Цикл
		
		Если ПроцедурыРаботыСНормамиСервер.ФизическоеЛицоМожетЯвлятьсяВнешнимПользователем(ФизическоеЛицо) Тогда
			
			//добавляем пользователя ИБ
			ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();  
			Если Константы.СпособАвтоматическогоФормированияЛогиновВнешнихПользователей.Получить() = Перечисления.СпособыАвтоматическогоФормированияЛогиновВнешнихПользователей.Префикс_ТабельныйНомер Тогда
				Сотрудник = Справочники.Сотрудники.НайтиПоРеквизиту("ФизическоеЛицо",ФизическоеЛицо);
				ПользовательИБ.Имя = Сотрудник.Владелец.Префикс + "_" + Сотрудник.ТабельныйНомер;
			ИначеЕсли Константы.СпособАвтоматическогоФормированияЛогиновВнешнихПользователей.Получить() = Перечисления.СпособыАвтоматическогоФормированияЛогиновВнешнихПользователей.ТабельныйНомер Тогда
				Сотрудник = Справочники.Сотрудники.НайтиПоРеквизиту("ФизическоеЛицо",ФизическоеЛицо);
				ПользовательИБ.Имя = Сотрудник.ТабельныйНомер;
			Иначе 
				ПользовательИБ.Имя = ПользователиСлужебныйКлиентСервер.ПолучитьКраткоеИмяПользователяИБ(ФизическоеЛицо.Наименование);
			КонецЕсли;
			ПользовательИБ.АутентификацияСтандартная 	= Истина;
			ПользовательИБ.ПоказыватьВСпискеВыбора 		= Ложь;
			ПользовательИБ.ПолноеИмя 					= ФизическоеЛицо.Наименование;
			ПользовательИБ.РежимЗапуска 				= РежимЗапускаКлиентскогоПриложения.Авто;
			ПользовательИБ.Язык 						= Метаданные.Языки.Русский;
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.БазовыеПраваВнешнегоПользователя);
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ВыводНаПринтерФайлБуферОбмена);
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ЗапускВебКлиента);
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ЗапускТонкогоКлиента);
			ПользовательИБ.Роли.Добавить(Метаданные.Роли.ИспользоватьРабочийСтолВнешнегоПользователя);
			//возможно, пользователь с таким имененм уже есть
			Попытка
				ПользовательИБ.Записать();
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Сообщить();
				Продолжить;
			КонецПопытки;
			
			//добавляем внешнего пользователя
			НовыйВнешнийПользователь = Справочники.ВнешниеПользователи.СоздатьЭлемент();
			НовыйВнешнийПользователь.ОбъектАвторизации 				= ФизическоеЛицо;
			НовыйВнешнийПользователь.Наименование 					= ФизическоеЛицо.Наименование;
			НовыйВнешнийПользователь.ИдентификаторПользователяИБ 	= ПользовательИБ.УникальныйИдентификатор;
			НовыйВнешнийПользователь.ОбменДанными.Загрузка			= Истина;
			НовыйВнешнийПользователь.Записать();
			
			//запись сведений в регистр
			НаборЗаписей = РегистрыСведений.СведенияОПользователях.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Пользователь.Установить(НовыйВнешнийПользователь.Ссылка);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				СведенияОПользователе = НаборЗаписей.Добавить();
				СведенияОПользователе.Пользователь = НовыйВнешнийПользователь.Ссылка;
			Иначе
				СведенияОПользователе = НаборЗаписей[0];
			КонецЕсли;
			СведенияОПользователе.ПотребоватьСменуПароляПриВходе = Истина;
		 	НаборЗаписей.Записать();
			
			//группа доступа
			ПрофильВнешнегоПользователя = Справочники.ПрофилиГруппДоступа.НайтиПоНаименованию("Внешние пользователи (физические лица)");
			ГруппаДоступаВнешнегоПользователя = Справочники.ГруппыДоступа.НайтиПоРеквизиту("Профиль",ПрофильВнешнегоПользователя);
			
			Если ЗначениеЗаполнено(ГруппаДоступаВнешнегоПользователя) Тогда
				ГруппаДоступаВнешнегоПользователяОбъект = ГруппаДоступаВнешнегоПользователя.ПолучитьОбъект();
				НоваяСтрока = ГруппаДоступаВнешнегоПользователяОбъект.Пользователи.Добавить();
				НоваяСтрока.Пользователь = НовыйВнешнийПользователь.Ссылка;
				ГруппаДоступаВнешнегоПользователяОбъект.Записать();
			КонецЕсли;
			
			//состав групп пользователей
			НаборЗаписей = РегистрыСведений.СоставыГруппПользователей.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ГруппаПользователей.Установить(НовыйВнешнийПользователь.Ссылка);
			НаборЗаписей.Отбор.Пользователь.Установить(НовыйВнешнийПользователь.Ссылка);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				СоставГруппПользователей = НаборЗаписей.Добавить();
				СоставГруппПользователей.ГруппаПользователей 	= НовыйВнешнийПользователь.Ссылка;
				СоставГруппПользователей.Пользователь 			= НовыйВнешнийПользователь.Ссылка;
			Иначе
				СоставГруппПользователей = НаборЗаписей[0];
			КонецЕсли;
			СоставГруппПользователей.Используется = Истина;
		 	НаборЗаписей.Записать();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Физическое лицо " + ФизическоеЛицо + " добавлено как внешний пользователь.";
			Сообщение.Сообщить();
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Физическое лицо " + ФизическоеЛицо + " не может быть внешним пользователем.
							|Проверьте, что физическое лицо является сотрудником и организации разрешен доступ сотрудников к базе.";
			Сообщение.Сообщить(); 
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	ЭтотОбъект.Элементы.Список.Обновить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВнешнихПользователей(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	МассивФизическихЛиц = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		Если ТипЗнч(ВыделеннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяСтрока = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
		
		Если ТекущаяСтрока.ВнешнийДоступ Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяСтрока <> Неопределено Тогда
			МассивФизическихЛиц.Добавить(ТекущаяСтрока.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	ДобавитьВнешнихПользователейНаСервере(МассивФизическихЛиц);
	
КонецПроцедуры
